Repository: bjankie1/flutter-flashcards
Catalog: lib/l10n/app_*.arb
Languages: pl

source: Add
pl: Dodaj

# addBackCardDescription
source: add back of the card description
pl: dodaj opis tyłu karty

source: Add card
pl: Dodaj kartę

source: Add cards to deck
pl: Dodaj karty

source: Add deck
pl: Dodaj zestaw

source: Add deck to group
pl: Dodaj zestaw do grupy

# addExplanationDescription
source: add answer explanation description
pl: dodaj opis wyjaśnienia odpowiedzi

# addFrontCardDescription
source: add front of the card description
pl: dodaj opis przodu karty

# allCardsReviewedMessage
source: Well done!
pl: Gratulacje!

# allProvisionaryCardsReviewedDescription
source: Great job! You've processed all your quick notes. They've been converted into proper flashcards and are ready for learning.
pl: Świetna robota! Przetworzyłeś wszystkie swoje szybkie notatki. Zostały przekształcone w odpowiednie fiszki i są gotowe do nauki.

# allProvisionaryCardsReviewedMessage
source: All card proposals reviewed!
pl: Wszystkie propozycje kart przejrzane!

# alreadyHaveAccount
source: Already have an account?
pl: Masz już konto?

source: Analysis
pl: Analiza

# answerHint
source: Answer text
pl: Tekst odpowiedzi

# answerLabel
source: Answer
pl: Odpowiedź

# answerRecordedMessage
source: Answer recorded
pl: Odpowiedź zapisana

# answersLabel
source: Answers:
pl: Odpowiedzi:

# answersLabelTooltip
source: Total number of answers (cards reviewed) in the selected period.
pl: Całkowita liczba odpowiedzi (przejrzanych kart) w wybranym okresie.

source: Apply
pl: Zastosuj

# appTitle
source: Flashcards
pl: Flashcards - fiszki

source: App Version
pl: Wersja aplikacji

# automaticUpdateChecks
source: Automatic update checks every 10 minutes
pl: Automatyczne sprawdzanie aktualizacji co 10 minut

# averageTimeLabel
source: Average (s):
pl: Średni czas (s):

# averageTimeLabelTooltip
source: Average time spent reviewing cards per day in the selected period.
pl: Średni czas poświęcony na przeglądanie kart dziennie w wybranym okresie.

# backCardDescriptionHint
source: Describe what should be on the back of cards in this deck
pl: Opisz co powinno być na tyle kart w tym zestawie

# backCardDescriptionLabel
source: Back of card description
pl: Opis tyłu karty

# backCardDescriptionSaveErrorMessage
source: Error saving back card description
pl: Błąd zapisywania opisu tyłu karty

# backCardDescriptionSavedMessage
source: Back card description saved
pl: Opis tyłu karty zapisany

# backCardLabel
source: Back card language
pl: Język na karcie z tyłu

source: Cancel
pl: Anuluj

# cancelButtonLabel
source: Cancel
pl: Anuluj

# cardAnswerDisplay
source: Answer:
pl: Odpowiedź:

# cardDeletedMessage
source: Card deleted
pl: Karta usunięta

# cardDeletionErrorMessage
source: Error deleting card
pl: Nie udało się usunąć karty

source: Card Descriptions
pl: Opisy kart

# cardDescriptionsAppliedMessage
source: Card descriptions applied successfully
pl: Opisy kart zostały zastosowane pomyślnie

# cardDescriptionsApplyErrorMessage
source: Error applying card descriptions
pl: Błąd podczas stosowania opisów kart

source: Card descriptions configured
pl: Opisy kart skonfigurowane

# cardDescriptionsGeneratedMessage
source: Card descriptions generated successfully
pl: Opisy kart zostały wygenerowane pomyślnie

# cardDescriptionsGenerationErrorMessage
source: Error generating card descriptions
pl: Błąd podczas generowania opisów kart

# cardOptionDoubleSided
source: Learn both sides
pl: Nauka obu stron karty

# cardOptionDoubleSidedTooltip
source: This card can be learned from both sides
pl: Ta karta może być uczona z obu stron

# cardProposalLabel
source: Card Proposal
pl: Propozycja karty

# cardQuestionDisplay
source: Question:
pl: Pytanie:

# cardReviewDaily
source: Cards reviews per day
pl: Liczba powtórek dziennie

# cardReviewDailyTooltip
source: Number of cards reviewed each day in the selected period.
pl: Liczba kart przejrzanych każdego dnia w wybranym okresie.

# cardReviewedPerHourHeader
source: Cards reviewed per hour
pl: Godziny powtórek

# cardReviewedPerHourTooltip
source: Distribution of card reviews by time of day. Helps you see when you study most.
pl: Rozkład recenzji kart według pory dnia. Pomaga zobaczyć, kiedy uczysz się najwięcej.

# cardSavedMessage
source: Card saved
pl: Karta zapisana

# cardSavingErrorMessage
source: Error saving card
pl: Nie udało się zapisać karty

source: Cards
pl: Karty

# cardsSearchHint
source: Search cards...
pl: Szukaj kart...

# cardsToReview
source: To review: {count}
pl: Do nauki: {count}

source: Check for Updates
pl: Sprawdź aktualizacje

source: Checking for updates...
pl: Sprawdzanie aktualizacji...

source: Close
pl: Zamknij

source: Collaboration
pl: Współpraca

# collaboratorsHeader
source: Collaborators
pl: Współpracownicy

source: Confidence Level
pl: Poziom pewności

source: Confirm
pl: Potwierdź

# confirmPasswordLabel
source: Confirm Password
pl: Potwierdź hasło

# countCardsPerDeckChartTitle
source: Number of cards studied per deck
pl: Według liczby kart

# countCardsPerDeckChartTooltip
source: Shows how many cards you studied from each deck.
pl: Pokazuje, ile kart przestudiowałeś z każdej talii.

# createCardTitle
source: Create card in **{deck}**
pl: Nowa karta w zestawie **{deck}**

source: Create new deck
pl: Utwórz nowy zestaw

source: Current Version
pl: Aktualna wersja

source: Deck description
pl: Opis zestawu

# deckDescriptionSaveErrorMessage
source: Error saving deck description
pl: Nie udało się zapisać opisu zestawu

# deckDescriptionSavedMessage
source: Deck description saved
pl: Opis zestawu zapisany

source: Deck Details
pl: Szczegóły talii

# deckEmptyMessage
source: Deck has no cards yet.
pl: Zestaw jest pusty.

# deckGeneration
source: Generate cards
pl: Generowanie zestawów kart

# deckHeader
source: Cards for {deckName}
pl: Zestaw: {deckName}

source: Deck name
pl: Nazwa zestawu

# deckNamePrompt
source: Please enter a deck name
pl: Proszę podać nazwę zestawu

# deckNameSavedMessage
source: Deck name saved
pl: Nazwa zestawu zapisana

# deckNotFoundMessage
source: Deck not found
pl: Nie ma takiego zestawu

# deckProgress
source: {deckName} Progress
pl: Postęp zestawu {deckName}

source: 'Deck saved!'
pl: Zestaw zapisany

# deckSelect
source: Select a deck
pl: Wybierz zestaw

# deckSharedFailedMessage
source: Failed sharing deck
pl: Wystąpił błąd podczas udostępniania

# deckSharedListTitle
source: People with access
pl: Kto ma już dostęp

# deckSharedMessage
source: Deck has been shared
pl: Deck udostępniony

# deckSharingHeader
source: Deck sharing
pl: Udostępnianie zestawu

source: Decks
pl: Zestawy

# decksTitle
source: My decks
pl: Moje zestawy

# decksWithoutGroupHeader
source: Decks without group
pl: Zestawy bez grupy

source: Delete
pl: Usuń

# deleteCardTooltip
source: Delete card
pl: Usuń kartę

source: Delete {deck}
pl: Usuń zestaw kart '{deck}'?

# deleteDeckConfirmation
source: Are you sure you want to delete this deck?
pl: Czy na pewno chcesz usunąć ten zestaw kart?

source: Deselect card
pl: Odznacz fiszkę

source: Discard
pl: Odrzuć

# docContentLength
source: Doc content length: {length}
pl: Długość treści dokumentu: {length}

# docLength
source: Doc length: {length}
pl: Długość dokumentu: {length}

# dontHaveAccount
source: Don't have an account?
pl: Nie masz konta?

source: Edit card
pl: Edytuj kartę

# editCardTitle
source: Editing card in **{deck}** deck
pl: Edycja karty w zestawie **{deck}**

source: Edit Cards
pl: Edytuj fiszki

source: Edit deck
pl: Edytuj zestaw

source: Enter Google Doc URL:
pl: Wprowadź URL Dokumentu Google:

source: Error loading cards
pl: Błąd ładowania kart

# errorLoadingCollaborators
source: Error loading collaborators: {error}
pl: Błąd ładowania współpracowników: {error}

# errorPrefix
source: Error: {message}
pl: Błąd: {message}

# errorSavingDescriptionMessage
source: Error saving description
pl: Nie udało się zapisać opisu

source: Error uploading image
pl: Błąd podczas przesyłania obrazu

# explanationDescriptionHint
source: Describe what explanations should include for answers in this deck
pl: Opisz co powinny zawierać wyjaśnienia odpowiedzi w tym zestawie

# explanationDescriptionLabel
source: Answer explanation description
pl: Opis wyjaśnienia odpowiedzi

# explanationDescriptionSaveErrorMessage
source: Error saving explanation description
pl: Błąd zapisywania opisu wyjaśnienia

# explanationDescriptionSavedMessage
source: Explanation description saved
pl: Opis wyjaśnienia zapisany

# explanationLabel
source: Explanation:
pl: Wyjaśnienie:

# fileSize
source: File size: {size} bytes
pl: Rozmiar pliku: {size} bajtów

# finalizeEditingWarning
source: Please save or cancel your edits in all fields before saving the card.
pl: Zapisz lub anuluj edycję wszystkich pól przed zapisaniem karty.

# frontCardDescriptionHint
source: Describe what should be on the front of cards in this deck
pl: Opisz co powinno być na przodzie kart w tym zestawie

# frontCardDescriptionLabel
source: Front of card description
pl: Opis przodu karty

# frontCardDescriptionSaveErrorMessage
source: Error saving front card description
pl: Błąd zapisywania opisu przodu karty

# frontCardDescriptionSavedMessage
source: Front card description saved
pl: Opis przodu karty zapisany

# frontCardLabel
source: Front card language
pl: Język na karcie z przodu

source: Generate Card Descriptions
pl: Generuj opisy kart

source: Generate cards
pl: Generuj karty

# generateCardsForDeck
source: Generate card for **{deck}** deck
pl: Wygeneruj karty dla zestawu {deck}

source: Generate flashcards
pl: Generuj fiszki

source: Generate from Google Doc
pl: Generuj z Dokumentu Google

source: Generated Card Descriptions
pl: Wygenerowane opisy kart

# generatedFlashcards
source: Generated Flashcards ({count})
pl: Wygenerowane fiszki ({count})

source: Go back
pl: Wróć

# googleDocHelperText
source: Paste the link to your Google Doc to generate cards from it.
pl: Wklej link do swojego Dokumentu Google, aby wygenerować z niego fiszki.

source: Google Doc Link
pl: Link do Dokumentu Google

# googleDocUrlExample
source: Example: https://docs.google.com/document/d/1BxiMVs0XRA5nFMdKvBdBZjgmUUqptlbs74OgvE2upms/edit
pl: Przykład: https://docs.google.com/document/d/1BxiMVs0XRA5nFMdKvBdBZjgmUUqptlbs74OgvE2upms/edit

# hintIconTooltip
source: This card has a hint
pl: Ta karta ma podpowiedź

# hintLabel
source: Hint
pl: Podpowiedź

# hintPrompt
source: Hint (optional)
pl: Opcjonalna podpowiedź

source: Image recorded
pl: Obraz zapisany

# inputText
source: Text
pl: Tekst

# inputTextForGenerator
source: Text to generate flashcards for
pl: Wprowadź tekst na podstawie którego chcesz wygenerować karty

# invalidEmailMessage
source: Please enter a valid email
pl: Proszę podać poprawny adres email

# invalidGoogleDocUrl
source: Invalid Google Doc URL. Please check the URL and try again.
pl: Nieprawidłowy URL Dokumentu Google. Sprawdź URL i spróbuj ponownie.

# invitationEmailHelperText
source: Invitees email
pl: Adres email osoby zapraszanej

# invitationErrorMessage
source: Error sending invitation
pl: Błąd podczas wysyłania zaproszenia

# invitationSentMessage
source: Invitation sent
pl: Zaproszenie wysłane

# inviteCollaboratorHint
source: Invite someone to collaborate on your flashcards
pl: Zaproś kogoś do współpracy nad fiszkami

# inviteCollaboratorPrompt
source: Enter collaborator email
pl: Zaproszenie współpracownika

# languageHint
source: Choose language
pl: Wybierz język

# lastUpdated
source: Last updated on {date}
pl: Ostatnia aktualizacja {date}

source: Later
pl: Potem

source: Latest Available Version
pl: Najnowsza dostępna wersja

source: Learn
pl: Nauka

source: Learn everything
pl: Pełna powtórka

# learnProgressMessage
source: {total} cards to review
pl: Pozostało {total} kart do nauki

source: Learning
pl: Nauczanie

# learningStatisticsAnswer
source: Answer
pl: Odpowiedź

# learningStatisticsClose
source: Close
pl: Zamknij

# learningStatisticsDay
source: {count, plural, one {# day} other {# days}}
pl: {count, plural, one{{count} dzień} few{{count} dni} many{{count} dni} other{{count} dni}}

# learningStatisticsDifficulty
source: Difficulty
pl: Trudność

# learningStatisticsDifficultyEasy
source: Easy
pl: Łatwa

# learningStatisticsDifficultyHard
source: Hard
pl: Trudna

# learningStatisticsDifficultyMedium
source: Medium
pl: Średnia

# learningStatisticsDialogTitle
source: Learning Statistics
pl: Statystyki nauki

# learningStatisticsDueAlready
source: due already
pl: już zaległa

# learningStatisticsHour
source: {count, plural, one {# hour} other {# hours}}
pl: {count, plural, one{{count} godzina} few{{count} godziny} many{{count} godzin} other{{count} godziny}}

# learningStatisticsLastReview
source: Last review
pl: Ostatnia powtórka

# learningStatisticsMetric
source: Metric
pl: Metryka

# learningStatisticsNextReview
source: Next review
pl: Następna powtórka

# learningStatisticsNotScheduled
source: Not scheduled
pl: Brak terminu

# learningStatisticsNumberOfReviews
source: Number of reviews
pl: Liczba powtórek

# learningStatisticsQuestion
source: Question
pl: Pytanie

# learningStatisticsToday
source: Today
pl: Dzisiaj

# learningStatisticsValue
source: Value
pl: Wartość

# learningStatisticsYesterday
source: Yesterday
pl: Wczoraj

# loadButton
source: Load
pl: Załaduj

# masteryLearning
source: Learning
pl: W nauce

# masteryMature
source: Mature
pl: Doświadczone

# masteryNew
source: New
pl: Nowe

# masteryYoung
source: Young
pl: Młode

source: Minimum Required Version
pl: Minimalna wymagana wersja

# monthDurationFilterLabel
source: Last month
pl: Ostatni miesiąc

source: My name
pl: Moje imię

# newDeckGroupAddedMessage
source: New deck group added
pl: Grupa została dodana

# newDeckGroupHelper
source: Enter new deck group name
pl: Podaj nazwę nowej grupy

# newDeckGroupName
source: New deck group
pl: Nowa grupa kart

# noCardsMessage
source: No cards found.
pl: Brak kart.

source: No cards to learn
pl: Brak kart do nauki

source: No collaborators yet
pl: Brak współpracowników

# noDecksMessage
source: No decks found. Add your first deck
pl: Nie masz jeszcze zestawów. Dodaj swój pierwszy.

# noProvisionaryCardsDescription
source: You don't have any quick notes waiting to be turned into flashcards. Add some by using the quick card creation feature.
pl: Nie masz żadnych szybkich notatek oczekujących na przekształcenie w fiszki. Dodaj je używając funkcji szybkiego dodawania kart.

# noProvisionaryCardsHeadline
source: No provisionary cards to review
pl: Brak notatek do przejrzenia

# noProvisionaryCardsMessage
source: No card proposals to review
pl: Brak propozycji kart do przejrzenia

# noSharedDecksMessage
source: No shared decks found
pl: Nie ma udostępnionych zestawów kart

# noUpdateAvailable
source: You're using the latest version
pl: Używasz najnowszej wersji

source: Not reviewed
pl: Nie sprawdzono

source: Open deck
pl: Otwórz zestaw

# orLabel
source: or
pl: lub

# passwordLabel
source: Password
pl: Hasło

source: Paste text
pl: Wklej tekst

# pasteTextHint
source: Paste your text here...
pl: Wklej swój tekst tutaj...

# pendingInvitationsHeader
source: Pending invitations
pl: Oczekujące zaproszenia

# personFilterLabel
source: You or friend
pl: Osoba

source: Personal info
pl: Informacje osobiste

# pleaseEnterGoogleDocUrl
source: Please enter a Google Doc URL
pl: Proszę wprowadzić URL Dokumentu Google

# printHours
source: {hours} hours
pl: {hours} godzin

# printMinutes
source: {minutes} minutes
pl: {minutes} minut

# printSeconds
source: {seconds} seconds
pl: {seconds} sekund

source: Profile
pl: Profil

source: Profile name changed
pl: Nazwa profilu zmieniona

# provisionaryCardsReviewButton
source: Review provisionary cards
pl: Przejrzyj notatki

# provisionaryCardsReviewHeadline
source: Provisionary cards review
pl: Przegląd notatek

# provisionaryCardText
source: Provisionary note
pl: Tekst do użycia w karcie

# questionHint
source: Question text
pl: Tekst pytania

# questionLabel
source: Question
pl: Pytanie

source: Quick add card
pl: Szybko dodaj kartę

# rateAgainLabel
source: Again
pl: Ponownie

# rateEasyLabel
source: Easy
pl: Łatwe

# rateGoodLabel
source: Good
pl: Dobrze

# rateHardLabel
source: Hard
pl: Trudne

# regenerateCardDescriptions
source: Regenerate descriptions
pl: Wygeneruj opisy ponownie

source: Regenerate flashcards
pl: Wygeneruj fiszki ponownie

source: Retry
pl: Ponów

# saveAndNext
source: Save and add next
pl: Zapisz i dodaj kolejną

# saveButton
source: Save
pl: Zapisz

source: Save to Deck
pl: Zapisz do talii

source: Saving...
pl: Zapisywanie...

source: Select card
pl: Zaznacz fiszkę

source: Select Google Doc
pl: Wybierz Dokument Google

source: Select input source
pl: Wybierz źródło danych

# sendInvitationButtonTooltip
source: Send invitation
pl: Wyślij zaproszenie

# sentInvitationsHeader
source: Sent invitations
pl: Wysłane zaproszenia

source: Settings
pl: Ustawienia

# shareDeck
source: Share deck with others
pl: Udostępnij zestaw

# sharedDecksHeader
source: Decks sheared by other users
pl: Zestawy udostępnione tobie

source: Show answer
pl: Pokaż odpowiedź

source: Show content
pl: Pokaż treść

# signIn
source: Login
pl: Zaloguj

# signInButton
source: Sign In
pl: Zaloguj się

# signInLink
source: Sign in
pl: Zaloguj się

# signInTitle
source: Sign In
pl: Zaloguj się

# signInWithGoogleButton
source: Sign in with Google
pl: Zaloguj się przez Google

# signOut
source: Logout
pl: Wyloguj

# signUpButton
source: Sign Up
pl: Zarejestruj się

# signUpLink
source: Sign up
pl: Zarejestruj się

# signUpTitle
source: Create Account
pl: Utwórz konto

# signUpWithGoogleButton
source: Sign up with Google
pl: Zarejestruj się przez Google

source: Statistics
pl: Statystyki

source: Switch to dark mode
pl: Przełącz na ciemny motyw

source: Switch to English
pl: Przełącz na język angielski

source: Switch to light mode
pl: Przełącz na jasny motyw

source: Switch to Polish
pl: Przełącz na język polski

# textContentLength
source: Text content length: {length}
pl: Długość tekstu: {length}

# timePerDeckChartTitle
source: Time spent per deck
pl: Czas poświęcony na każdy zestaw

# timePerDeckChartTooltip
source: Shows how much time you spent studying each deck.
pl: Pokazuje, ile czasu spędziłeś na nauce każdej talii.

# totalProgressLabel
source: Total Progress
pl: Całkowity postęp

# totalTimeLabel
source: Total time:
pl: Całkowity czas:

# totalTimeLabelTooltip
source: Total time spent reviewing cards in the selected period.
pl: Całkowity czas poświęcony na przeglądanie kart w wybranym okresie.

source: Update Available
pl: Dostępna aktualizacja

# updateAvailableMessage
source: A new version of the app is available. Update now to get the latest features and improvements.
pl: Dostępna jest nowa wersja aplikacji. Zaktualizuj teraz, aby uzyskać najnowsze funkcje i ulepszenia.

# updateCheckFailed
source: Failed to check for updates
pl: Nie udało się sprawdzić aktualizacji

# updateComplete
source: Update complete! The app will reload.
pl: Aktualizacja zakończona! Aplikacja zostanie przeładowana.

# updateDownloading
source: Downloading update...
pl: Pobieranie aktualizacji...

# updateError
source: Update failed. Please try again.
pl: Aktualizacja nie powiodła się. Spróbuj ponownie.

# updateInstalling
source: Installing update...
pl: Instalowanie aktualizacji...

# updateLater
source: Later
pl: Później

source: Update Now
pl: Zaktualizuj teraz

# updateReminder
source: Don't forget to update! A new version is available.
pl: Nie zapomnij zaktualizować! Dostępna jest nowa wersja.

source: Update Settings
pl: Ustawienia aktualizacji

# updatingApp
source: Updating...
pl: Aktualizowanie...

source: Upload image
pl: Wyślij obraz

source: Upload new file
pl: Wyślij nowy plik

source: Upload PDF
pl: Wyślij PDF

# userNotLoggedIn
source: You need to log in
pl: Musisz być zalogowany

# versionCheckingWebOnly
source: Version checking is only available on web platform
pl: Sprawdzanie wersji jest dostępne tylko na platformie web

# warningTitle
source: Warning
pl: Ostrzeżenie

# weekDurationFilterLabel
source: Last 7 days
pl: Ostatnie 7 dni

source: Your name
pl: Twoje imię
